{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspaceName": {
      "type": "string"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules",
      "kind": "Scheduled",
      "apiVersion": "2023-12-01-preview",
      "name": "[concat(parameters('workspaceName'), '/Microsoft.SecurityInsights/', 'da730419-4ba2-47db-9076-a0792ce376b8')]",
      "properties": {
        "displayName": "Suspicious PowerShell Execution",
        "description": "Detects encoded or unusual PowerShell flags commonly used in initial access or execution phases.",
        "severity": "Medium",
        "enabled": true,
        "query": "SecurityEvent\n| where EventID == 4688\n| where Process has \"powershell.exe\" or NewProcessName has \"powershell.exe\"\n| where CommandLine has \"-encodedcommand\" or CommandLine has \"-enc\" or CommandLine has \"-e\"",
        "queryFrequency": "PT1H",
        "queryPeriod": "PT1H",
        "triggerOperator": "GreaterThan",
        "triggerThreshold": 0,
        "suppressionDuration": "PT1H",
        "suppressionEnabled": false,
        "startTimeUtc": null,
        "tactics": [
          "Execution"
        ],
        "techniques": [
          "T1059"
        ],
        "subTechniques": [],
        "alertRuleTemplateName": null,
        "incidentConfiguration": {
          "createIncident": true,
          "groupingConfiguration": {
            "enabled": false,
            "reopenClosedIncident": false,
            "lookbackDuration": "PT5H",
            "matchingMethod": "AllEntities",
            "groupByEntities": [],
            "groupByAlertDetails": [],
            "groupByCustomDetails": []
          }
        },
        "eventGroupingSettings": {
          "aggregationKind": "SingleAlert"
        },
        "alertDetailsOverride": null,
        "customDetails": null,
        "entityMappings": [
          {
            "entityType": "Host",
            "fieldMappings": [
              {
                "identifier": "FullName",
                "columnName": "Computer"
              }
            ]
          }
        ],
        "sentinelEntitiesMappings": null,
        "templateVersion": null
      }
    }
  ]
}
