{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspaceName": {
      "type": "String"
    }
  },
  "resources": [
    {
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspaceName'), 'Microsoft.SecurityInsights'),'/alertRules/4e91daae-7230-4623-af16-e6df87e4cd1e')]",
      "name": "[concat(parameters('workspaceName'),'/Microsoft.SecurityInsights/4e91daae-7230-4623-af16-e6df87e4cd1e')]",
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules",
      "kind": "Scheduled",
      "apiVersion": "2023-12-01-preview",
      "properties": {
        "displayName": "Service Accounts Performing Remote PS",
        "description": "Service Accounts Performing Remote PowerShell. Identifies service accounts that are performing remote powershell sessions using DeviceLogonEvents and DeviceEvents to locate anomalies without requiring attacking client telemetry.",
        "severity": "High",
        "enabled": true,
        "query": "let InteractiveTypes = pack_array('Interactive','CachedInteractive','Unlock','RemoteInteractive','CachedRemoteInteractive','CachedUnlock');\nlet WhitelistedCmdlets = pack_array('prompt','Out-Default','out-lineoutput','format-default','Set-StrictMode','TabExpansion2');\nlet WhitelistedAccounts = pack_array('FakeWhitelistedAccount');\nDeviceLogonEvents\n| where AccountName !in~ (WhitelistedAccounts)\n| where ActionType == \"LogonSuccess\"\n| where AccountName !contains \"$$\"\n| where AccountName !has \"winrm va_\"\n| extend IsInteractive=(LogonType in (InteractiveTypes))\n| summarize HasInteractiveLogon=max(IsInteractive) by AccountName\n| where HasInteractiveLogon == 0\n| join kind=rightsemi (DeviceEvents | where ActionType == 'PowerShellCommand' | where InitiatingProcessFileName =~ 'wsmprovhost.exe' | extend AccountName = InitiatingProcessAccountName) on AccountName\n| extend Command = tostring(extractjson('$.Command', tostring(AdditionalFields)))\n| where Command !in (WhitelistedCmdlets)\n| summarize (Timestamp, ReportId)=arg_max(TimeGenerated, ReportId), make_set(Command, 100000), count(), min(TimeGenerated) by AccountName, AccountDomain, DeviceName, DeviceId\n| order by AccountName asc\n| extend HostName = iff(DeviceName has '.', substring(DeviceName, 0, indexof(DeviceName, '.')), DeviceName)\n| extend DnsDomain = iff(DeviceName has '.', substring(DeviceName, indexof(DeviceName, '.') + 1), \"\")",
        "queryFrequency": "PT1H",
        "queryPeriod": "PT1H",
        "triggerOperator": "GreaterThan",
        "triggerThreshold": 0,
        "suppressionDuration": "PT1H",
        "suppressionEnabled": false,
        "startTimeUtc": null,
        "tactics": [
          "LateralMovement"
        ],
        "techniques": [
          "T1210"
        ],
        "subTechniques": [],
        "alertRuleTemplateName": "d29cc957-0ddb-4d00-8d6f-ad1bb345ff9a",
        "incidentConfiguration": {
          "createIncident": true,
          "groupingConfiguration": {
            "enabled": false,
            "reopenClosedIncident": false,
            "lookbackDuration": "PT5H",
            "matchingMethod": "AllEntities",
            "groupByEntities": [],
            "groupByAlertDetails": [],
            "groupByCustomDetails": []
          }
        },
        "eventGroupingSettings": {
          "aggregationKind": "SingleAlert"
        },
        "alertDetailsOverride": null,
        "customDetails": null,
        "entityMappings": [
          {
            "entityType": "Host",
            "fieldMappings": [
              { "identifier": "FullName", "columnName": "DeviceName" },
              { "identifier": "HostName", "columnName": "HostName" },
              { "identifier": "DnsDomain", "columnName": "DnsDomain" }
            ]
          },
          {
            "entityType": "Account",
            "fieldMappings": [
              { "identifier": "FullName", "columnName": "AccountName" },
              { "identifier": "DnsDomain", "columnName": "AccountDomain" },
              { "identifier": "Name", "columnName": "AccountName" }
            ]
          }
        ],
        "sentinelEntitiesMappings": null,
        "templateVersion": "1.0.0"
      }
    }
  ]
}
