{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspaceName": {
      "type": "string"
    },
    "location": {
      "type": "string",
      "defaultValue": "[resourceGroup().location]"
    }
  },
  "variables": {
    "workbookDisplayName": "SOC-Central-Threat-Intelligence-Dashboard",
    "workbookId": "[guid(resourceGroup().id, variables('workbookDisplayName'))]"
  },
  "resources": [
    {
      "type": "Microsoft.Insights/workbooks",
      "apiVersion": "2023-06-01",
      "name": "[variables('workbookId')]",
      "location": "[parameters('location')]",
      "kind": "shared",
      "properties": {
        "displayName": "[variables('workbookDisplayName')]",
        "serializedData": "{\"version\":\"Notebook/1.0\",\"items\":[{\"type\":1,\"content\":{\"json\":\"## 🏢 SOC Central Threat Intelligence Operations Dashboard\\nWelcome to your unified security monitoring command center.\"},\"name\":\"heading\"},{\"type\":3,\"content\":{\"version\":\"KqlParameterItem/1.0\",\"parameters\":[{\"id\":\"timeRange\",\"type\":4,\"name\":\"TimeRange\",\"isRequired\":true,\"value\":{\"durationMs\":86400000},\"typeSettings\":{\"options\":[1,3,7,14,30,90]}}]},\"name\":\"parameters\"},{\"type\":3,\"content\":{\"version\":\"KqlItem/1.0\",\"query\":\"SecurityIncident | summarize Count = count() by Severity\",\"size\":0,\"title\":\"Active Incidents by Severity Matrix\",\"queryType\":0,\"resourceType\":\"microsoft.operationalinsights/workspaces\",\"visualization\":\"barchart\"},\"name\":\"incident_chart\"}],\"isLocked\":false}",
        "version": "Notebook/1.0",
        "category": "sentinel",
        "sourceId": "[concat('/subscriptions/', subscription().subscriptionId, '/resourceGroups/', resourceGroup().name, '/providers/Microsoft.OperationalInsights/workspaces/', parameters('workspaceName'))]"
      }
    }
  ]
}
